
public class HelloWorld {

	public static void main(String[] args) {
	    //переменная объявляется путём написания её типа, затем имя. Опционально можно задать значение.созидёт
	    int k = 10;//Целое число k со знаком.
	    //Поведение переменных зависит от того, скалярная ли она или со ссылкой. Это две больших группы. Со ссылкой идут уже только классы.
	    //Отличие в том, что со ссылкой переменные надо явно создавать.
	    String str = new String("лингвистика");
	    //Строка ниже эквивалентна, просто это укороченная запись:
	    String str2 = "лингвистика";
	    
		System.out.println("Анастасия, Вы молодец!");

	}

}
